package com.eosa.admin.util.random;

import lombok.Data;

@Data
public class AddressTempData {
    
    private final String[] REGIONAL_LOCAL_NAME = {
        "서울시", "인천시", "경기도", "광주시", "대구시", "대전시",
        "세종시", "강원도", "충청북도", "충천남도", "전라북도", "전라남도",
        "경상북도", "경상남도", "울산시", "부산시", "제주도"
    };

    private final String[] SEOUL = {
        "종로구", "중구", "용산구", "성동구", "광진구", "동대문구",
        "중랑구", "성북구", "강북구", "도봉구", "노원구", "은평구",
        "서대문구", "마포구", "양천구", "강서구", "구로구", "금천구",
        "영등포구", "동작구", "서초구", "강남구", "송파구", "강동구"
    };

    private final String[] INCHEON = {
        "중구", "동구", "미추홀구", "연수구", "남동구", "부평구",
        "계양구", "서구", "강화군", "용진군"
    };

    private final String[]  GYEONGGIDO = {
        "수원시", "고양시", "용인시", "성남시", "화성시", "부천시", 
        "남양주시", "안산시", "안양시", 
        "평택시", "시흥시", "김포시", "파주시", "의정부시", "광주시",
        "하남시", "광명시", "군포시", "양주시", "구리시", "오산시",
        "안성시", "의왕시", "이천시", "포천시", "동두천시", "과천시",
        "여주시",
        "양평군", "가평군", "연천군"
    };

    private final String[] GWANGJU = {
        "동구", "서구", "남구", "북구", "광산구"
    };

    private final String[] DAEGU = {
        "중구", "동구", "서구", "남구", "북구", "수성구", "달서구", "달성군"
    };

    private final String[] DAEJEON = {
        "동구", "중구", "서구", "유성구", "대덕구"
    };

    private final String[] SAEJONG = {
        "조치원읍", "연기면", "연동면", "부강면", "금남면",
        "장군면", "연서면", "전의면", "전동면", "소정면",
        "한솔동", "새롬동", "도담동", "해밀동", "아름동",
        "종촌동", "고운동", "소담동", "반곡동", "보람동",
        "대평동", "다정동"
    };   

    private final String[] GANGWONDO = {
        "춘천시", "원주시", "강릉시", "동해시", "태백시", "속초시",
        "삼척시", 
        "홍천군", "횡성군", "영월군", "평창군", "정선군", "철원군",
        "화천군", "양구군", "인제군", "고성군", "양양군"
    };

    private final String[] CHUNGBUK = {
        "청주시", "충주시", "제천시",
        "보은군", "옥천군", "영동군", "증평군",
        "진천군", "괴산군", "음성군", "단양군"
    };

    private final String[] CHUNGNAM = {
        "천안시", "공주시", "보령시", "아산시", "서산시", "논산시",
        "계룡시", "당진시",
        "금산군", "부여군", "서천군", "청양군", "홍성군", "예산군", "태안군"
    };

    private final String[] JEONBUK = {
        "전주시", "익산시", "군산시", "정읍시", "남원시", "김제시",
        "완주군", "고창군", "부안군", "임실군", "순창군", "진안군",
        "무주군", "장수군"
    };

    private final String[] JEONNAM = {
        "목포시", "여수시", "순천시", "나주시", "광양시",
        "담양군", "곡성군", "구례군", "고흥군", "보성군",
        "화순군", "장흥군", "강진군", "해남군", "영암군",
        "무안군", "함평군", "장성군", "완도군", "진도군",
        "신안군"
    };

    private final String[] GYEONGSANGBUK = {
        "포항시", "경주시", "김천시", "안동시", "구미시",
        "영주시", "영천시", "상주시", "문경시", "경산시",
        "군위군", "의성군", "청송군", "영양군", "영덕군",
        "청도군", "고령군", "성주군", "칠곡군", "예천군",
        "봉화군", "울진군", "울릉군"
    };

    private final String[] GYEONGSANGNAM = {
        "창원시", "김해시", "양산시", "진주시", "거제시", "통영시",
        "사천시", "밀양시",
        "함안군", "거창군", "창녕군", "고성군", "하동군", "합천군",
        "남해군", "함양군", "산청군", "의령군"
    };

    private final String[] ULSAN = {
        "중구", "남구", "동구", "북구", "울주군"
    };

    private final String[] BUSAN = {
        "중구", "서구", "동구", "영도구", "부산진구", "동래구",
        "남구", "북구", "강서구", "해운대구", "사하구", "금정구",
        "연재구", "수영구", "사상구", "기장군"
    };

    private final String[] JEJU = {
        "제주시", "서귀포시"
    };

    private final String[][] REGION2 = {
        {
            "종로구", "중구", "용산구", "성동구", "광진구", "동대문구",
            "중랑구", "성북구", "강북구", "도봉구", "노원구", "은평구",
            "서대문구", "마포구", "양천구", "강서구", "구로구", "금천구",
            "영등포구", "동작구", "서초구", "강남구", "송파구", "강동구"
        },
        {
            "중구", "동구", "미추홀구", "연수구", "남동구", "부평구",
            "계양구", "서구", "강화군", "용진군"
        },    
        {
            "수원시", "고양시", "용인시", "성남시", "화성시", "부천시", 
            "남양주시", "안산시", "안양시", 
            "평택시", "시흥시", "김포시", "파주시", "의정부시", "광주시",
            "하남시", "광명시", "군포시", "양주시", "구리시", "오산시",
            "안성시", "의왕시", "이천시", "포천시", "동두천시", "과천시",
            "여주시",
            "양평군", "가평군", "연천군"
        },    
        {
            "동구", "서구", "남구", "북구", "광산구"
        },
        {
            "중구", "동구", "서구", "남구", "북구", "수성구", "달서구", "달성군"
        },
        {
            "동구", "중구", "서구", "유성구", "대덕구"
        },
        {
            "조치원읍", "연기면", "연동면", "부강면", "금남면",
            "장군면", "연서면", "전의면", "전동면", "소정면",
            "한솔동", "새롬동", "도담동", "해밀동", "아름동",
            "종촌동", "고운동", "소담동", "반곡동", "보람동",
            "대평동", "다정동"
        },    
        {
            "춘천시", "원주시", "강릉시", "동해시", "태백시", "속초시",
            "삼척시", 
            "홍천군", "횡성군", "영월군", "평창군", "정선군", "철원군",
            "화천군", "양구군", "인제군", "고성군", "양양군"
        },    
        {
            "청주시", "충주시", "제천시",
            "보은군", "옥천군", "영동군", "증평군",
            "진천군", "괴산군", "음성군", "단양군"
        },
        {
            "천안시", "공주시", "보령시", "아산시", "서산시", "논산시",
            "계룡시", "당진시",
            "금산군", "부여군", "서천군", "청양군", "홍성군", "예산군", "태안군"
        },
        {
            "전주시", "익산시", "군산시", "정읍시", "남원시", "김제시",
            "완주군", "고창군", "부안군", "임실군", "순창군", "진안군",
            "무주군", "장수군"
        },
        {
            "목포시", "여수시", "순천시", "나주시", "광양시",
            "담양군", "곡성군", "구례군", "고흥군", "보성군",
            "화순군", "장흥군", "강진군", "해남군", "영암군",
            "무안군", "함평군", "장성군", "완도군", "진도군",
            "신안군"
        },
        {
            "포항시", "경주시", "김천시", "안동시", "구미시",
            "영주시", "영천시", "상주시", "문경시", "경산시",
            "군위군", "의성군", "청송군", "영양군", "영덕군",
            "청도군", "고령군", "성주군", "칠곡군", "예천군",
            "봉화군", "울진군", "울릉군"
        },
        {
            "창원시", "김해시", "양산시", "진주시", "거제시", "통영시",
            "사천시", "밀양시",
            "함안군", "거창군", "창녕군", "고성군", "하동군", "합천군",
            "남해군", "함양군", "산청군", "의령군"
        }
        ,
        {
            "중구", "남구", "동구", "북구", "울주군"
        },
        {
            "중구", "서구", "동구", "영도구", "부산진구", "동래구",
            "남구", "북구", "강서구", "해운대구", "사하구", "금정구",
            "연재구", "수영구", "사상구", "기장군"
        },
        {
            "제주시", "서귀포시"
        }
    };
}
